# Найти и вывести на экран факториал числа с помощью функции math

import math

num = int(input('Введите число: '))
print(math.factorial(num))
